testScripts/gatling/user-files/request-bodies/GetSubjectOfCareSchedule_ERIK.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:interoperability:headers:1" xmlns:urn1="urn:riv:itintegration:registry:1" xmlns:urn2="urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1">
   <soapenv:Header>
      <urn:Actor>
         <urn:actorId>?</urn:actorId>
         <urn:actorType>?</urn:actorType>
         <!--You may enter ANY elements at this point-->
      </urn:Actor>
      <urn1:LogicalAddress>HSAPRODUCER1</urn1:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn2:GetSubjectOfCareSchedule>
         <urn2:healthcare_facility>HSA-VKK123</urn2:healthcare_facility>
         <urn2:subject_of_care>192506298112</urn2:subject_of_care>
         <!--You may enter ANY elements at this point-->
      </urn2:GetSubjectOfCareSchedule>
   </soapenv:Body>
</soapenv:Envelope>
